Catalogs/Комнаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Комнаты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКомнаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКомнат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Комнаты/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Родитель.
	Родитель = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(
					Родитель,
					ПолучитьСвойство(ДанныеЗаполнения, "Родитель"));
	
	// ТипСтола.
	ТипКомнаты = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(
					ТипКомнаты,
					ПолучитьСвойство(ДанныеЗаполнения, "ТипКомнаты", Родитель.ТипКомнаты));
	ТипКомнаты = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(
					ТипКомнаты,
					Справочники.ТипыКомнат.ОсновнойТипКомнаты());
					
	// Номер и Наименование.
	Если Не ЭтоГруппа Тогда
	
		Номер = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(
					Номер,
					ПолучитьСвойство(ДанныеЗаполнения, "Номер", Справочники.Комнаты.ПолучитьОчереднойКод(ЭтотОбъект)));
		Наименование = Справочники.Комнаты.ПолучитьНаименование(ЭтотОбъект);
		
	КонецЕсли; 					
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// ТипСтола.
	Если ЭтоГруппа Тогда
		__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, , "ТипКомнаты");
	Иначе
		
		Если ДополнительныеСвойства.Свойство("ПредотвратитьПроверкуУникальности") Тогда
			ДополнительныеСвойства.Удалить("ПредотвратитьПроверкуУникальности")
		Иначе
			
			Если Не __УправлениеДаннымиСервер.ПроверитьУникальностьРеквизитаСправочника(ЭтотОбъект, "Номер") Тогда
				__ОбщегоНазначенияСервер.СообщитьОбНеуникальностиРеквизитаСправочника(ЭтотОбъект, "Номер", , Отказ);
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	Актуальность = Истина;
	Если Не ЭтоГруппа Тогда
		
		Номер = Справочники.Комнаты.ПолучитьОчереднойКод(ЭтотОбъект);
		Наименование = Справочники.Комнаты.ПолучитьНаименование(ЭтотОбъект);
		
	КонецЕсли; 					
	
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ)

	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Нормализация.
	Если Не ЭтоГруппа Тогда
		
		Если ПустаяСтрока(Наименование) Тогда
			Наименование = Справочники.Комнаты.ПолучитьНаименование(ЭтотОбъект);
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
